[
    {
        "sr_no":5.1,
        "controller":"Information security policy and topic-specific policies should be defined, approved by management, published, communicated to and acknowledged by relevant personnel and relevant interested parties,and reviewed at planned intervals and if significant changes occur",
        "Purpose":"To ensure continuing suitability, adequacy, effectiveness of management direction and support for information security in accordance with business, legal, statutory, regulatory and contractual requirements.",
        "Guidance":"At the highest level, the organization should define an information security policy which is approved by top management and which sets out the organizations approach to managing its information security.\\n The information security policy should take into consideration requirements derived from: \\n a) business strategy and requirements \\n b) regulations legislation and contracts \\n c) the current and projected information security risks and threats.\\n The information security policy should contain statements concerning: \\n  a) definition of information security \\n b) information security objectives or the framework for setting information security objectives \\n c) principles to guide all activities relating to information security \\n  d) commitment to satisfy applicable requirements related to information securityv \\n e) commitment to continual improvement of the information security management system \\n  f) assignment of responsibilities for information security management to defined roles; \\n g) procedures for handling exemptions and exceptions. \\n Top management should approve any changes to the information security policy. \\n At a lower level, the information security policy should be supported by topic-specific policies as needed, to further mandate the implementation of information security controls. Topic-specific policies are typically structured to address the needs of certain target groups within an organization or to  cover certain security areas. Topic-specific policies should be aligned with and complementary to the  information security policy of the organization. \\n  Examples of such topics include: \\n  a) access control \\n b) physical and environmental security \\n c) asset management \\n d) information transfer \\n e) secure configuration and handling of user endpoint devices \\n f) networking security \\n g) information security incident management \\n  h) backup \\n i) cryptography and key management \\n j) information classification and handling \\n k) management of technical vulnerabilities \\n l) secure development \\n The responsibility for the development, review and approval of the topic-specific policies should be allocated to relevant personnel based on their appropriate level of authority and technical competency.The review should include assessing opportunities for improvement of the organization’s information security policy and topic-specific policies and managing information security in response to changes to: \\n a) the organization’s business strategy; b) the organization’s technical environment; \\n c) regulations, statutes, legislation and contracts; \\n d) information security risks; \\n e) the current and projected information security threat environment; \\n f) lessons learned from information security events and incidents. \\n The review of information security policy and topic-specific policies should take the results of management reviews and audits into account. Review and update of other related policies should be considered when one policy is changed to maintain consistency. \\n The information security policy and topic-specific policies should be communicated to relevant personnel and interested parties in a form that is relevant, accessible and understandable to the intended reader. Recipients of the policies should be required to acknowledge they understand and agree to comply with the policies where applicable. The organization can determine the formats and names of these policy documents that meet the organization’s needs. In some organizations, the information security policy and topic-specific policies can be in a single document.The organization can name these topic-specific policies as standards,directives, policies or others. \\n  If the information security policy or any topic-specific policy is distributed outside the organization, care should be taken not to improperly disclose confidential information",
        "Other_Information":"Topic-specific policies can vary across organizations"
    }
    ]